{"premise": "It was a complex language. Not written down but handed down. One might say it was peeled down.", "hypothesis": "the language was peeled down", "idx": 0}
{"premise": "It is part of their religion, a religion I do not scoff at as it holds many elements which match our own even though it lacks the truth of ours. At one of their great festivals they have the ritual of driving out the devils from their bodies. First the drummers come on - I may say that no women are allowed to take part in this ritual and the ladies here will perhaps agree with me that they are fortunate in that omission.", "hypothesis": "no women are allowed to take part in this ritual", "idx": 1}
{"premise": "The Paris to Rouen railway was being extended to Le Havre, and the line cut straight through Dr Flaubert's land. Part of it was to be compulsorily purchased. You could say that Gustave was shepherded into creative retreat at Croisset by epilepsy.", "hypothesis": "Gustave was shepherded into creative retreat at Croisset by epilepsy", "idx": 2}
{"premise": "Part of it was to be compulsorily purchased. You could say that Gustave was shepherded into creative retreat at Croisset by epilepsy. You could also say he was driven there by the railway.", "hypothesis": "Gustave was driven to creative retreat in Croisset by the railway", "idx": 3}
{"premise": "Some of them, like for instance the farm in Connecticut, are quite small. If I like a place I buy it. I guess you could say it's a hobby.", "hypothesis": "buying places is a hobby", "idx": 4}
{"premise": "Look, my dear, I'm not in my dotage yet, and I know I'm a grumbler and a complainer. You could say the only form of comfort I 've got are my complaints.", "hypothesis": "the only form of comfort he has are his complaints", "idx": 5}
{"premise": "Then the silence in the Zoo became complete. Woil stared around him and then suddenly with a push of his wings raised himself into the air, turned, and landed ten feet away on the back of a green bench. Creggan could see that he was afraid and that his fear was making him terribly uncertain.", "hypothesis": "Woil was afraid", "idx": 6}
{"premise": "But, of course, that just wasn't possible. Her disappointment over Jonathan, which had driven her to France in the first place, had been relegated somewhere to the back of her mind. Now in retrospect she could see that marriage to him would have been a ghastly mistake and that her reaction to discovering that he had been seeing other women while he had been engaged to her had had far more to do with wounded pride than with a wounded heart.", "hypothesis": "marriage to Jonathan would have been a ghastly mistake", "idx": 7}
{"premise": "Like now. The Community in Knockglen would defend Eve vociferously. Even some of the Sisters here in Dublin might see that the girl had a point.", "hypothesis": "the girl had a point", "idx": 8}
{"premise": "``They have to be crushed, Bobkins!'' So saying, she marched off down the gravel path, making the kind of crunching noise Robert had thought could only be produced by the BBC sound-effects department. As they rounded the edge of the building he could see that behind the house was a vast garden.", "hypothesis": "behind the house was a vast garden", "idx": 9}
{"premise": "``Do you mind if I use your phone?'' Ronni could see that Guido's brain was whirring.", "hypothesis": "Guido's brain was whirring", "idx": 10}
{"premise": "``Look, lady, give me a break. I just deliver the stuff, I don't interview it for the Sunday papers.'' He waved the paper at her and even at a distance she could see that it said very little.", "hypothesis": "the paper said very little", "idx": 11}
{"premise": "``You 've heard something like that before. Haven't you, Jimmy?'' Jimmy had been shaken by those sounds more shaken than the others for good reason but Cardiff could see that he was unprepared to show it as he pushed himself away from the reception counter.", "hypothesis": "Jimmy was unprepared to show he had been shaken", "idx": 12}
{"premise": "It was Alan's idea. He made a sour kind of joke out of it, that they must wait until their wedding night. Carolyn agreed because she could see he meant it although she didn't understand why.", "hypothesis": "Alan meant it", "idx": 13}
{"premise": "And why bother to write anyway? What was there to say? Mary had some vague idea that Adam's parents might suspect he was down here and come to see him.", "hypothesis": "Adam was down here", "idx": 14}
{"premise": "``And you're not having this dress,'' Nora said, bending down to look at the price tag. ``It's two and a half guineas!'' she hissed at Louise who could tell that she was genuinely appalled.", "hypothesis": "Nora was genuinely appalled", "idx": 15}