{"source": "Daily mail", "passage": {"text": "The harrowing stories of women and children locked up for so-called 'moral crimes' in Afghanistan's notorious female prison have been revealed after cameras were allowed inside. Mariam has been in Badam Bagh prison for three months after she shot a man who just raped her at gunpoint and then turned the weapon on herself - but she has yet to been charged. Nuria has eight months left to serve of her sentence for trying to divorce her husband. She gave birth in prison to her son and they share a cell together. Scroll down for video Nuria was jailed for trying to divorce her husband. Her son is one of 62 children living at Badam Bagh prison\n@highlight\nMost of the 202 Badam Bagh inmates are jailed for so-called 'moral crimes'\n@highlight\nCrimes include leaving their husbands or refusing an arrange marriage\n@highlight\n62 children live there and share cells with their mothers and five others", "entities": [{"start": 86, "end": 96}, {"start": 178, "end": 183}, {"start": 197, "end": 206}, {"start": 357, "end": 361}, {"start": 535, "end": 539}, {"start": 627, "end": 636}, {"start": 672, "end": 681}]}, "qas": [{"query": "The baby she gave birth to is her husbands and he has even offered to have the courts set her free if she returns, but @placeholder has refused.", "idx": 0}], "idx": 0}
{"source": "CNN", "passage": {"text": "Caracas, Venezuela (CNN) -- It's been more than 180 years since Venezuelans saw Simon Bolivar's face. But the revolutionary leader's thick sideburns, bushy eyebrows and steely gaze popped out from behind picture frames Tuesday in new 3-D images unveiled by President Hugo Chavez. Researchers used several software programs to reconstruct the face of the man who liberated Bolivia, Colombia, Ecuador, Panama, Peru and Venezuela from the Spanish crown. Scans of Bolivar's skeletal remains, which investigators exhumed two years ago, factored into their calculations. So did historical paintings, photos of restored uniforms Bolivar wore and images of middle-aged Venezuelans, officials said.\n@highlight\nResearchers use computer programs to reconstruct Simon Bolivar's face\n@highlight\nVenezuelan President Hugo Chavez unveils new, 3-D portraits of Bolivar\n@highlight\nResearchers use data from skeletal remains exhumed two years ago\n@highlight\nAn investigation into Bolivar's 1830 death has been inconclusive, the government says", "entities": [{"start": 0, "end": 6}, {"start": 9, "end": 17}, {"start": 20, "end": 22}, {"start": 64, "end": 74}, {"start": 80, "end": 92}, {"start": 234, "end": 236}, {"start": 267, "end": 277}, {"start": 372, "end": 378}, {"start": 381, "end": 388}, {"start": 391, "end": 397}, {"start": 400, "end": 405}, {"start": 408, "end": 411}, {"start": 417, "end": 425}, {"start": 436, "end": 442}, {"start": 460, "end": 466}, {"start": 622, "end": 628}, {"start": 661, "end": 671}, {"start": 750, "end": 762}, {"start": 782, "end": 791}, {"start": 803, "end": 813}, {"start": 828, "end": 830}, {"start": 845, "end": 851}, {"start": 962, "end": 968}]}, "qas": [{"query": "In 1819, @placeholder founded Gran Colombia, a federation of what is now Venezuela, Colombia, Panama and Ecuador.", "idx": 2}], "idx": 1}
{"source": "Daily mail", "passage": {"text": "For everyone who has ever thought about shooting their boss - metaphorically, o fcourse - this one is for you. An employee of a Texas armored car company got to do just that this week to 'demonstrate that they take client safety seriously'. And to further that demonstration, the CEO was sitting alone inside the Mercedes-Benz as 12 rounds from an AK-47 rained down upon the SUV. The company, Texas Armoring Corporation, has supplied protected vehicles to the Pope, celebrities like rapper T.I. and actor Steven Segal and oil executives in West Africa, according to My San Antonio. Texas Armoring Corp. & Jason Forston.\n@highlight\nTexas Armoring Corporation created a video to show the effectiveness of their armored\n@highlight\nCEO R. Trent Kimball sat in the drivers seat of a Mercedes-Benz SUV\n@highlight\nTotal of 12 rounds fired at the windscreen\n@highlight\nCompany known for working with celebrities, oil barons and even the Pope", "entities": [{"start": 128, "end": 132}, {"start": 313, "end": 325}, {"start": 348, "end": 352}, {"start": 393, "end": 418}, {"start": 460, "end": 463}, {"start": 483, "end": 493}, {"start": 505, "end": 516}, {"start": 540, "end": 550}, {"start": 569, "end": 579}, {"start": 582, "end": 601}, {"start": 605, "end": 617}, {"start": 631, "end": 656}, {"start": 735, "end": 747}, {"start": 778, "end": 790}, {"start": 929, "end": 932}]}, "qas": [{"query": "'When it comes to assuring our clients' safety, we take product testing extremely seriously,' @placeholder says in a video taken of the display.", "idx": 10}], "idx": 4}
{"source": "Daily mail", "passage": {"text": "The way you use Facebook and Twitter could mirror how narcissistic you are, according to a new university study. Research by the University of Michigan examined how social media websites reflect a growing culture of narcissism in the US. Scientists found that middle-aged narcissists are more likely to frequently update their Facebook status, while their younger counterparts take to Twitter to satisfy their vanity. So vain: Adult narcissists are more likely to use Facebook to gain the approval of their peers to boost their ego, according to new research According to Elliot Panek, who was one of three scientists behind the research, middle-aged people use Facebook as a way of gaining approval of their image from their peers, while college students prefer Twitter because they over-value their own opinions.\n@highlight\nNew research examines link between social media and narcissism\n@highlight\nIt found younger users are most likely to take to Twitter to boost their ego\n@highlight\nBut older users will update Facebook in a bid to gain approval from friends", "entities": [{"start": 16, "end": 23}, {"start": 29, "end": 35}, {"start": 129, "end": 150}, {"start": 234, "end": 235}, {"start": 327, "end": 334}, {"start": 385, "end": 391}, {"start": 468, "end": 475}, {"start": 572, "end": 583}, {"start": 662, "end": 669}, {"start": 763, "end": 769}, {"start": 950, "end": 956}, {"start": 1016, "end": 1023}]}, "qas": [{"query": "According to the study, @placeholder acts as a megaphone for younger web users.", "idx": 13}], "idx": 7}
{"source": "CNN", "passage": {"text": "(CNN) -- During a 1996 interview with television talk show host Charlie Rose, Apple co-founder Steve Jobs took exception to Rose's characterization of him as \"a guy who founds high-tech companies and tries to make another billion.\" \"Yeah, well, I don't think of myself that way,\" Jobs said. \"The things that I have done in my life, I think the things we do now at Pixar [the animation company he bought in 1986], these are team sports. They are not something one person does.\" If pop culture were a team sport, Jobs would have certainly played quarterback. From the invention of iTunes, which completely changed the business of music, to offering the world its first completely full-length computer-generated animated film with Pixar's \"Toy Story\" in 1995, Jobs left his indelible fingerprints on the entertainment industry.\n@highlight\nSteve Jobs pioneered inventions that changed the way the world consumed media\n@highlight\nPixar made the first fully computer-generated animated film\n@highlight\nBillboard editor says Jobs brillance made buying music easy and fun", "entities": [{"start": 1, "end": 3}, {"start": 64, "end": 75}, {"start": 78, "end": 82}, {"start": 95, "end": 104}, {"start": 124, "end": 127}, {"start": 280, "end": 283}, {"start": 364, "end": 368}, {"start": 511, "end": 514}, {"start": 579, "end": 584}, {"start": 728, "end": 732}, {"start": 737, "end": 745}, {"start": 757, "end": 760}, {"start": 836, "end": 845}, {"start": 925, "end": 929}, {"start": 996, "end": 1004}, {"start": 1018, "end": 1021}]}, "qas": [{"query": "@placeholder was a major influence on portable media, which paved the way for gamers to be able to engage in their favorite past time via handheld devices and film fans to be able to stream movies almost anywhere.", "idx": 18}], "idx": 10}
{"source": "Daily mail", "passage": {"text": "Ahead of this weekend's Premier League action, Sportsmail will be providing you with all you need to know about every fixture, with team news, provisional squads, betting odds and Opta stats... Here is all the information you need for Arsenal's home clash with Manchester City... You can like our Arsenal Facebook page here Arsenal vs Manchester City (Emirates Stadium) Kick-off: Saturday 12.45pm - BT Sport 1 Odds (subject to change): Arsenal 7/4 Draw 12/5 Manchester City 6/4 Referee: Mark Clattenburg Managers: Arsene Wenger (Arsenal), Manuel Pellegrini (Manchester City) Head-to-head league record: Arsenal wins 85, draws 41, Manchester City wins 46\n@highlight\nDanny Welbeck could make his Arsenal debut following £16million arrival from Manchester United on transfer deadline day\n@highlight\nAaron Ramsey to be assessed while Mikel Arteta back in full training\n@highlight\nDavid Ospina and Kieran Gibbs are also on the mend for Gunners\n@highlight\nMesut Ozil likely to be fit after missing out for Germany\n@highlight\nStevan Jovetic will miss out for Manchester City with hamstring injury\n@highlight\nFernando will also miss out but Vincent Kompany likely to start\n@highlight\nEliaquim Mangala and Frank Lampard could make debuts", "entities": [{"start": 24, "end": 37}, {"start": 47, "end": 56}, {"start": 180, "end": 183}, {"start": 235, "end": 241}, {"start": 261, "end": 275}, {"start": 297, "end": 317}, {"start": 324, "end": 330}, {"start": 335, "end": 349}, {"start": 352, "end": 367}, {"start": 399, "end": 406}, {"start": 436, "end": 442}, {"start": 458, "end": 472}, {"start": 487, "end": 502}, {"start": 514, "end": 526}, {"start": 529, "end": 535}, {"start": 539, "end": 555}, {"start": 558, "end": 572}, {"start": 603, "end": 609}, {"start": 630, "end": 644}, {"start": 665, "end": 677}, {"start": 694, "end": 700}, {"start": 742, "end": 758}, {"start": 796, "end": 807}, {"start": 830, "end": 841}, {"start": 876, "end": 887}, {"start": 893, "end": 904}, {"start": 931, "end": 937}, {"start": 950, "end": 959}, {"start": 1000, "end": 1006}, {"start": 1019, "end": 1032}, {"start": 1052, "end": 1066}, {"start": 1101, "end": 1108}, {"start": 1133, "end": 1147}, {"start": 1176, "end": 1191}, {"start": 1197, "end": 1209}]}, "qas": [{"query": "Manchester City are without midfielder @placeholder (groin) and striker Stevan Jovetic (hamstring) will miss Saturday's Barclays Premier League trip to Arsenal.", "idx": 19}], "idx": 11}
{"source": "Daily mail", "passage": {"text": "Their faces covered, a gang of Ethiopian youths marches towards a rival camp in Calais brandishing sticks and rocks. As they come into sight, a group of Eritreans arm themselves and rush out to defend their territory. But French riot police are on the scene within minutes. After firing tear gas from behind their shields they manage to drive the groups apart. Yesterday’s clash was over almost as soon as it started – but it will happen again today. And tomorrow. Scroll down for video Anger: Police step in when immigrants in Calais cause a disturbance, using canisters of tear gas on the camps while the immigrants retaliate with thrown stones and sticks over the fence\n@highlight\nFrench police pictured breaking up fights between rival groups\n@highlight\nOfficers are stretched to breaking point by constant violence\n@highlight\nThe gangs fight over the best routes to the ferry port to the UK", "entities": [{"start": 31, "end": 39}, {"start": 80, "end": 85}, {"start": 153, "end": 161}, {"start": 222, "end": 227}, {"start": 528, "end": 533}, {"start": 684, "end": 689}, {"start": 893, "end": 894}]}, "qas": [{"query": "It is thought that rows with people-smugglers who charge up to £1,000 cash for passage to @placeholder have also contributed to the trouble.", "idx": 23}], "idx": 15}
{"source": "CNN", "passage": {"text": "Washington (CNN) -- When Chris Christie praises President Barack Obama as \"outstanding\" and \"incredibly supportive,\" you know something extraordinary has occurred. Obama updated on Sandy; praised by Christie In this case, it was once-in-a-lifetime Superstorm Sandy, which caused the outspoken Republican governor of New Jersey to declare a state of emergency and seek federal help for widespread devastation. Interviewed Tuesday on NBC, Christie described Obama's response as \"outstanding,\" and he told CNN that the president had been \"incredibly supportive and helpful to our state.\" \"This is much more important than any election,\" Christie told CNN's \"Piers Morgan Tonight.\" Obama has \"been outstanding to deal with on this and I look forward to seeing him tomorrow so he can see for himself what this hurricane has done to my state,\" Christie said Tuesday night.\n@highlight\nMitt Romney surrogate Chris Christie praises President Barack Obama's response to Sandy\n@highlight\nThe superstorm focuses attention on the role of government in disaster relief\n@highlight\nRomney advocates a state-led approach, but his campaign promises enough funding\n@highlight\nObama emphasizes federal, state and local cooperation", "entities": [{"start": 0, "end": 9}, {"start": 12, "end": 14}, {"start": 25, "end": 38}, {"start": 58, "end": 69}, {"start": 164, "end": 168}, {"start": 181, "end": 185}, {"start": 199, "end": 206}, {"start": 248, "end": 263}, {"start": 293, "end": 302}, {"start": 316, "end": 325}, {"start": 432, "end": 434}, {"start": 437, "end": 444}, {"start": 456, "end": 460}, {"start": 503, "end": 505}, {"start": 634, "end": 641}, {"start": 648, "end": 650}, {"start": 655, "end": 674}, {"start": 678, "end": 682}, {"start": 838, "end": 845}, {"start": 878, "end": 888}, {"start": 900, "end": 913}, {"start": 933, "end": 944}, {"start": 960, "end": 964}, {"start": 1066, "end": 1071}, {"start": 1157, "end": 1161}]}, "qas": [{"query": "Romney has made political dysfunction in @placeholder a target of his campaign, blaming Obama for what he calls failed leadership in being unable to forge a deficit reduction deal with Republicans.", "idx": 28}], "idx": 17}
{"source": "Daily mail", "passage": {"text": "By Toby Harnden PUBLISHED: 10:25 EST, 10 October 2012 | UPDATED: 07:52 EST, 11 October 2012 Paul Ryan hopes to deliver a knockout blow to President Barack Obama's hopes of re-election if he prevails in tonight's debate in Kentucky. While the Romney campaign has been publicly playing down the chances of Representative Ryan, chairman of the House Budget Committee, scoring a major victory in the vice-presidential debate, privately hopes are high that he could do very well. And if the pictures in the next edition of TIME magazine of the vice-presidential candidate working out in December 2011 are anything to go by, he's pumped up for the 'Thrill in the Ville', in Danville.\n@highlight\nExpectations are high that Republican vice presidential nominee Paul Ryan will win the debate against Vice President Joe Biden\n@highlight\nBiden, a senator for 36 years, is a far more experienced debater than Ryan, who is 27 years younger than Biden\n@highlight\nRepublican nominee Mitt Romney is tamping down expectations that Ryan will win the debate to avoid negative fallout if his running mate fails to impress", "entities": [{"start": 3, "end": 14}, {"start": 92, "end": 100}, {"start": 148, "end": 159}, {"start": 222, "end": 229}, {"start": 242, "end": 247}, {"start": 319, "end": 322}, {"start": 341, "end": 362}, {"start": 518, "end": 530}, {"start": 657, "end": 661}, {"start": 668, "end": 675}, {"start": 716, "end": 725}, {"start": 753, "end": 761}, {"start": 806, "end": 814}, {"start": 827, "end": 831}, {"start": 897, "end": 900}, {"start": 932, "end": 936}, {"start": 949, "end": 958}, {"start": 968, "end": 978}, {"start": 1014, "end": 1017}]}, "qas": [{"query": "Charmer: Ryan is widely seen as one of the most intellectually impressive of a new @placeholder generation", "idx": 34}], "idx": 20}
{"source": "CNN", "passage": {"text": "Singapore (CNN) -- Lior Peleg cuts an incongruous figure at the Singapore Airshow. Among the suited middle-aged men selling military hardware she looks more like a beach-loving backpacker, casually dressed in a black tank-top with a camera slung around her neck. But what really marks her out among all the arms salesmen touting the newest military technology -- \"lethal but affordable\" reads one sign above a missile manufacturer -- is that she one of the few people present with operational military experience. She's a former drone pilot for the Israeli military and represents the new face of air force pilots.\n@highlight\nUnmanned Aerial Vehicles -- drones -- now a huge part of military operations across globe\n@highlight\nCongressional paper: United States has nearly 7,500 UAVs of all sizes and capabilities\n@highlight\nAnalysts predict half of U.S. military aircraft will be unmanned within five years\n@highlight\nUAVs in missions raise questions over role of humans in combat environments", "entities": [{"start": 0, "end": 8}, {"start": 11, "end": 13}, {"start": 19, "end": 28}, {"start": 64, "end": 80}, {"start": 549, "end": 555}, {"start": 626, "end": 649}, {"start": 748, "end": 760}, {"start": 779, "end": 782}, {"start": 850, "end": 853}]}, "qas": [{"query": "As well as a different face, @placeholder then represents just one small part of this new network changing the way militaries operate.", "idx": 43}], "idx": 28}
{"source": "CNN", "passage": {"text": "(CNN) -- New videos posted from the Syrian flashpoint city of Homs suggest a fresh wave of killings by the Syrian military after the fall of the neighborhood of Baba Amr. Activists have provided CNN with footage purportedly showing the bodies of 17 civilians that were discovered February 29 in villages near Baba Amr following an all-out assault on the Homs neighborhood that had held off a government assault for weeks. Much of the video is too graphic to show on air, but analysis of the video showed at least 12 bodies. In one, bodies are piled up in the back of a truck bed covered in blankets. Snow falls on the bodies as people in the background wail, some shouting, \"There is no God but God!\" One man off camera says, \"These are the victims of the massacre by the Shabiha (a government militia), entire families slaughtered by the forces of Assad\" -- a reference to Syrian President Bashar al-Assad.\n@highlight\nNEW: Opposition activists say they think more vidoes of horror in Baba Amr will surface\n@highlight\nVideo footage purportedly shows the bodies of 17 civilians discovered near Baba Amr\n@highlight\nA man describes entire families slaughtered by President Bashar al-Assad's forces\n@highlight\nAvaaz: At least six people killed came from the same family", "entities": [{"start": 1, "end": 3}, {"start": 36, "end": 41}, {"start": 62, "end": 65}, {"start": 107, "end": 112}, {"start": 161, "end": 168}, {"start": 195, "end": 197}, {"start": 309, "end": 316}, {"start": 354, "end": 357}, {"start": 600, "end": 603}, {"start": 687, "end": 689}, {"start": 695, "end": 697}, {"start": 772, "end": 778}, {"start": 849, "end": 853}, {"start": 874, "end": 879}, {"start": 891, "end": 905}, {"start": 985, "end": 992}, {"start": 1093, "end": 1100}, {"start": 1170, "end": 1184}, {"start": 1206, "end": 1210}]}, "qas": [{"query": "The activist cited eyewitnesses as claiming that @placeholder and armed forces rushed through the area opening fire on residents.", "idx": 48}], "idx": 31}
{"source": "CNN", "passage": {"text": "(CNN) -- Anthony Sullivan was a young Australian with Robert Redford looks. Richard Adams emigrated from the Philippines as a child and became an American citizen. The two met in Los Angeles, fell in love and got married in Boulder, Colorado -- long before any state legalized same-sex marriage. County Clerk Clela Rorex issued the gay couple a marriage license at 11 a.m., April 21, 1975. Nothing in the Colorado marriage code mentioned same-sex marriage, and Rorex signed licenses for six couples before the district attorney advised her to end to them. But the licenses were never rescinded. Sullivan and Adams believed their marriage was legal and embarked on a decades-long struggle to attain permanent resident status for Sullivan.\n@highlight\nAustralian Tony Sullivan married Richard Adams, a U.S. citizen, in 1975\n@highlight\nNo country in the world recognized same-sex marriage then\n@highlight\nSullivan overstayed his tourist visa and lived under the radar in order to be with his love\n@highlight\nOne year after DOMA was struck down, Sullivan is trying again for permanent residence", "entities": [{"start": 1, "end": 3}, {"start": 9, "end": 24}, {"start": 38, "end": 47}, {"start": 54, "end": 67}, {"start": 76, "end": 88}, {"start": 109, "end": 119}, {"start": 146, "end": 153}, {"start": 179, "end": 189}, {"start": 224, "end": 230}, {"start": 233, "end": 240}, {"start": 309, "end": 319}, {"start": 405, "end": 412}, {"start": 461, "end": 465}, {"start": 595, "end": 602}, {"start": 608, "end": 612}, {"start": 728, "end": 735}, {"start": 749, "end": 758}, {"start": 760, "end": 772}, {"start": 782, "end": 794}, {"start": 799, "end": 802}, {"start": 901, "end": 908}, {"start": 1019, "end": 1022}, {"start": 1041, "end": 1048}]}, "qas": [{"query": "After @placeholder's demise, about 40,000 such couples became eligible for immigration rights.", "idx": 52}], "idx": 33}
{"source": "Daily mail", "passage": {"text": "By Aladair Glennie British television is being bought wholesale by greedy American corporations, the head of Channel 4 has warned. The channel's chief executive David Abraham said billionaire media tycoons and production companies want to invest in this country to avoid tax in the US. ITV could one day be owned entirely by shareholders based across the Atlantic while our favourite shows could be produced by internet giants such as Netflix and Google, he said. Giving the annual MacTaggart lecture at the Edinburgh International Television Festival, Mr Abraham called on politicians to do more to protect the UK television industry from overseas interference.\n@highlight\nDavid Abraham said ITV could be owned entirely by US shareholders\n@highlight\nHe claimed our favourite shows could be produced by Netflix and Google\n@highlight\nAbraham was giving the annual MacTaggart lecture in Edinburgh", "entities": [{"start": 3, "end": 17}, {"start": 19, "end": 25}, {"start": 74, "end": 81}, {"start": 109, "end": 117}, {"start": 161, "end": 173}, {"start": 282, "end": 283}, {"start": 286, "end": 288}, {"start": 355, "end": 362}, {"start": 435, "end": 441}, {"start": 447, "end": 452}, {"start": 482, "end": 491}, {"start": 508, "end": 550}, {"start": 556, "end": 562}, {"start": 612, "end": 613}, {"start": 674, "end": 686}, {"start": 693, "end": 695}, {"start": 724, "end": 725}, {"start": 803, "end": 809}, {"start": 815, "end": 820}, {"start": 833, "end": 839}, {"start": 863, "end": 872}, {"start": 885, "end": 893}]}, "qas": [{"query": "He added: '@placeholder media companies [are] eager to stay ahead of each other by internationalising their revenues…and shielding their tax exposure.'", "idx": 54}], "idx": 35}
{"source": "Daily mail", "passage": {"text": "Head of Sport Lee Clayton gives his view on  whether some of England's younger players should represent the Under 21s next summer in the Czech Republic There has been plenty of talk of full internationals joining the Under 21s in the summer after Gareth Southgate and his squad qualified for the European Championship. Arsene Wenger and Roberto Martinez have already come out and stated it wouldn’t be beneficial to their players to play and that’s no surprise as they will always look after their clubs’ interests rather than the national team’s. That is a big problem in this country. My view is it’s not a black-and-white case.\n@highlight\nThere has been plenty of talk of who England should take to the Under 21 European Championship next summer\n@highlight\nFully fledged regulars for club and country — like Jack Wilshere and Raheem Sterling — would benefit from a free summer\n@highlight\nBut the likes Calum Chambers, Alex Oxlade-Chamberlain, Ross Barkley, Luke Shaw and John Stones would benefit from playing\n@highlight\nIt could be vital for the senior side ahead of Euro 2016 in France", "entities": [{"start": 0, "end": 24}, {"start": 61, "end": 67}, {"start": 108, "end": 116}, {"start": 137, "end": 150}, {"start": 217, "end": 225}, {"start": 247, "end": 262}, {"start": 296, "end": 316}, {"start": 319, "end": 331}, {"start": 337, "end": 352}, {"start": 679, "end": 685}, {"start": 706, "end": 710}, {"start": 715, "end": 735}, {"start": 811, "end": 823}, {"start": 829, "end": 843}, {"start": 905, "end": 918}, {"start": 921, "end": 943}, {"start": 946, "end": 957}, {"start": 960, "end": 968}, {"start": 974, "end": 984}, {"start": 1071, "end": 1079}, {"start": 1084, "end": 1089}]}, "qas": [{"query": "VIDEO Scroll down to watch Watch @placeholder's post-match dressing room speech", "idx": 56}], "idx": 37}
{"source": "CNN", "passage": {"text": "Washington (CNN) -- Top congressional Republicans on Friday used a new dismal jobs report to blast Democrats' push for more tax revenue in the ongoing debt ceiling negotiations, arguing that such a move would derail an already shaky economic recovery. Federal officials reported Friday that the economy added only 18,000 jobs in June -- far below the number predicted by most economists. Unemployment inched up another tenth of a point to 9.2%. \"Today's report is more evidence that the misguided 'stimulus' spending binge, excessive regulations, and an overwhelming national debt continue to hold back private-sector job creation in our country,\" said House Speaker John Boehner, R-Ohio. \"A debt limit increase that raises taxes or fails to make serious spending cuts won't pass the House.\"\n@highlight\nGOP leaders say Friday's poor jobs report is more evidence tax hikes can't be part of a deal\n@highlight\nDemocrats and Republicans are trying to reach a deal to raise the debt ceiling by August 2\n@highlight\nBoehner says that Democrats' insistence on tax hikes jeopardizes any long-term deal\n@highlight\nWhite House source says Obama will insist on a long-term deal in talks Sunday evening", "entities": [{"start": 0, "end": 9}, {"start": 12, "end": 14}, {"start": 99, "end": 107}, {"start": 653, "end": 657}, {"start": 667, "end": 678}, {"start": 681, "end": 686}, {"start": 784, "end": 788}, {"start": 803, "end": 805}, {"start": 921, "end": 931}, {"start": 1009, "end": 1015}, {"start": 1027, "end": 1035}, {"start": 1104, "end": 1114}, {"start": 1128, "end": 1132}]}, "qas": [{"query": "Congressional Democrats, meanwhile, are wrestling with rising anger among liberal @placeholder members in the wake of news that the president might agree to entitlement cuts.", "idx": 58}, {"query": "The aide, however, insisted the only real talks going on are between Obama and @placeholder, who are holding discussions \"in good faith.\"", "idx": 59}], "idx": 39}
{"source": "CNN", "passage": {"text": "Los Angeles (CNN) -- Jurors began deliberations Thursday in the Michael Jackson wrongful-death trial, potentially bringing the contentious case to a close after five months of testimony and three days of closing arguments. The 12 jurors spent two hours in the jury room Thursday afternoon before ending their day; they will return Friday morning for more deliberations. Katherine Jackson's lawyer delivered his final arguments in the AEG Live trial Thursday morning, delivering his rebuttal to defense closing arguments. AEG Live's Marvin Putnam had asked jurors to find Michael Jackson responsible for his death, not the company that promoted and produced his comeback concerts in 2009.\n@highlight\nNEW: The jury will resume deliberations Friday\n@highlight\nAEG Live's Marvin Putnam asked jurors to find Michael Jackson responsible for his death\n@highlight\nFamily lawyer: \"How dare they accept no responsibility and blame it all on Michael\"\n@highlight\nThe Jacksons are asking for $1 billion to $2 billion in damages from AEG Live", "entities": [{"start": 0, "end": 10}, {"start": 13, "end": 15}, {"start": 64, "end": 78}, {"start": 370, "end": 386}, {"start": 434, "end": 441}, {"start": 521, "end": 528}, {"start": 532, "end": 544}, {"start": 571, "end": 585}, {"start": 757, "end": 764}, {"start": 768, "end": 780}, {"start": 803, "end": 817}, {"start": 931, "end": 937}, {"start": 955, "end": 962}, {"start": 1020, "end": 1027}]}, "qas": [{"query": "Putnam argued that the number, if the jury finds @placeholder liable, should be closer to $21 million, the amount of money AEG Live's expert calculated Jackson would have given his mother and three children over the next 16 years.", "idx": 67}], "idx": 43}